nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1170/lwip_examples/lwip_httpssrv_mbedTLS_enet_qos/freertos/cm7/pin_mux.c
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MIMXRT1176xxxxx
package_id: MIMXRT1176DVMAA
mcu_data: ksdk2_0
processor_version: 0.9.6
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitDebugConsolePins();
    BOARD_InitEnetPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDebugConsolePins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: L13, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24, slew_rate: Slow}
  - {pin_num: M15, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDebugConsolePins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDebugConsolePins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitEnetPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: E13, peripheral: ENET_QOS, signal: enet_rx_en, pin_signal: GPIO_DISP_B1_00, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver}
  - {pin_num: D13, peripheral: ENET_QOS, signal: enet_rx_clk, pin_signal: GPIO_DISP_B1_01, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver}
  - {pin_num: D11, peripheral: ENET_QOS, signal: 'enet_rdata, 00', pin_signal: GPIO_DISP_B1_02, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver}
  - {pin_num: E11, peripheral: ENET_QOS, signal: 'enet_rdata, 01', pin_signal: GPIO_DISP_B1_03, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver}
  - {pin_num: E10, peripheral: ENET_QOS, signal: 'enet_rdata, 02', pin_signal: GPIO_DISP_B1_04, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver}
  - {pin_num: C11, peripheral: ENET_QOS, signal: 'enet_rdata, 03', pin_signal: GPIO_DISP_B1_05, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver}
  - {pin_num: D10, peripheral: ENET_QOS, signal: 'enet_tdata, 03', pin_signal: GPIO_DISP_B1_06, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver}
  - {pin_num: E12, peripheral: ENET_QOS, signal: 'enet_tdata, 02', pin_signal: GPIO_DISP_B1_07, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver}
  - {pin_num: A15, peripheral: ENET_QOS, signal: 'enet_tdata, 01', pin_signal: GPIO_DISP_B1_08, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver}
  - {pin_num: C13, peripheral: ENET_QOS, signal: 'enet_tdata, 00', pin_signal: GPIO_DISP_B1_09, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver}
  - {pin_num: A14, peripheral: ENET_QOS, signal: enet_tx_clk, pin_signal: GPIO_DISP_B1_11, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver}
  - {pin_num: B14, peripheral: ENET_QOS, signal: enet_tx_en, pin_signal: GPIO_DISP_B1_10, pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver}
  - {pin_num: A5, peripheral: GPIO11, signal: 'gpio_io, 14', pin_signal: GPIO_DISP_B2_13, slew_rate: Slow}
  - {pin_num: U2, peripheral: ENET_QOS, signal: enet_mdc, pin_signal: GPIO_EMC_B2_19, pull_down_pull_up_config: Pull_Down, open_drain: Disable}
  - {pin_num: R3, peripheral: ENET_QOS, signal: enet_mdio, pin_signal: GPIO_EMC_B2_20, pull_down_pull_up_config: Pull_Down, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

